while :
do
cat <<-EOF
+-------------------------------------------------------------------------+ 
|                         米奇妙妙 牌工具脚本(1.0.3)                      | 
+-------------------------------------------------------------------------+
|                     1. 安装源       			                  |
|                     2. 关闭selinux      		                  |
|                     3. 关闭防火墙       				  |
|		      4. 下载常用软件包  				  |
|		      5. 下载pyhton3.6					  |
|                     6. 打开python                       		  |
|                     7. Quit                                             | 
+-------------------------------------------------------------------------+ 
EOF
. /root/33.sh
echo "请输入你的选择 " && read var
case "$var" in
  		"1")	mod_yum
				;; 
		"2")	close_selinux
				;; 
		"3")	close_firewalld
				;; 
		"4")	install_softwares
				;;
		"5")	python_install
				;;
		"6")	python3
			exit
				;;
		"7")	
				exit
				;; 
			*)
				printf "请输入以上选项\n"
				continue
				;; 
esac
done
